<?php

namespace Database\Seeders;

use Illuminate\Database\Console\Seeds\WithoutModelEvents;
use Illuminate\Database\Seeder;
use Illuminate\Support\Facades\DB;

class PostsSeeder extends Seeder
{
    /**
     * Run the database seeds.
     */
    public function run(): void
    {
        DB::table('posts')->insert([
            'title' => "لماذا يقوم السياسيون بهذه الحركة الغريبة؟",
            'slug' => "لماذا-يقوم-السياسيون-بهذه-الحركة-الغريبة",
            'body' => "<p>السياسة بحر واسع، وقد لا نحبُّ الدخول فيها والخوض في أحاديثها، لكنّنا نستطيع الاستفادة ممّا يفعل السياسيون في بعض النواحي، خصوصًا في لغة الجسد والاشارات، فعندنا ما يكفي من المعلومات لتُخبرنا أنَّهم يتعاونون مع خُبراء في علم النفس ولغة الجسد لإحكام تأثيرهم في الناس، فلماذا لا نستفيد مجانا ممّا يصرفون؟
            أحد هذه الطرق هي حركة تُستخدم في الخطابات، قبضة مرتخية يعلوُ فيها الابهام على السبابة، كما لو كُنت تُقدِّم نقودًا إلى المقابل، والصورة تشرح أكثر.
            يقول العميل السابق في الـ FBI وخبير لغة الجسد جو نافارو أنَّ هذه الحركة أصبحت شائعة في الحملات الانتخابية وخطباء الرؤساء، وتُستخدم غالبًا عندما يُريدون ايصال نقطة معيّنة ويؤكدّون عليها.
            الاشارة تُوحي كما لو أنَّك تؤكِّد على نقطة، خصوصًا وأنّنا نستخدم حركات مُشابهة في مسك القلم أو الأكل أو الرسم، وهذه كلّها حركات فيها قدر كبير من التصميم.
            هناك حركة مُشابهة المعنى يستخدمها دونالد ترامب، وهي أكثر شيوعًا لدى رؤساء العالم خارج أمريكًا، وهي كما لو أنَّك تُشير بإشارة OK بأحدى يديك أو كلتيهما.
            </p>",
            'user_id' => 3,
            'approved' => true,
            'category_id' => 1,
            'created_at' =>'2022-05-05 05:08:00',
            'image_path' =>'politica.png'
        ]);

        DB::table('posts')->insert([
            'title' => "أسعار الفائدة وآثارها على الاقتصاد",
            'slug' => "أسعار-الفائدة-وآثارها-على-الاقتصاد",
            'body' => "<p>يموج عالم اليوم بالعديد من المتغيرات المختلفة التي تؤثر على كافة المؤشرات الاقتصادية صعوداً وهبوطاً، ولعل أهم تلك الأبعاد التي تؤثر بشكل كبير على كافة المحاور الاقتصادية هي أسعار الفائدة.
            ونعني بأسعار الفائدة حجم الأموال التي يحصل عليها المودعون نتيجة إيداعهم لمبلغ من المال خلال مدة زمنية محددة، وقد تكون أسعار الفائدة ثابتة وأحياناً متغيرة.
            كما يقصد بها أيضاً مقدار ما يدفعه المقترضون لقاء حصولهم على مبالغ معينة تسمى القروض من المؤسسات المالية كالبنوك وغيرها.
            إذاً فأسعار الفائدة حق للمودع يحصل عليه نظير وديعته في بنك معين؛ ودين على المقترض الذي يقوم بدوره بتسديد تلك الفوائد نتيجة حصوله على قرض من أحد البنوك.
            على سبيل المثال لو أن أسعار الفائدة على الودائع في بنك معين 15%، وسعر الفائدة على القروض الممنوحة للعملاء 17%، فيكون هناك فائض 2% للبنك، وتعتبر هذه النسبة مصدر أساسي من مصادر دخل البنك ومصدراً مهماً للأرباح
            هذه كانت نبذة عن مفهوم أسعار الفائدة، تبقى لنا أن نتحدث عن تأثيرات أسعار الفائدة على العديد من المؤشرات الاقتصادية، ولعل أهمها:
            البطالة: توجد علاقة وطيدة بين أسعار الفائدة وبين نسب البطالة في المجتمع، فعندما ترتفع أسعار الفائدة تزيد تكلفة الإنتاج والمواد الخام وبناءً عليه تزيد أسعار المنتجات، والذي بدوره ينعكس مباشرة على انخفاض الطلب والمبيعات للمنتجات، وهذا الأمر بدوره يؤدي إلى خسائر كبيرة للشركات، تجبر الشركات على تصفية العمالة الموجودة داخل الشركة لتقليل التكاليف وتعويض الخسائر، ويؤدي ذلك إلى ارتفاع معدلات البطالة، والعكس صحيح تماماً فانخفاض أسعار الفائدة يؤدي إلى إنخفاض معدلات البطالة.
            أسواق الأسهم والسندات: دائماً ما يبحث المستثمر عن أفضل مكان يمنحه أسعاراً عالية للفائدة، فعندما تزيد أسعار الفائدة في البنوك يقل حجم الاستثمار في الأسهم، ويحدث ذلك لأن أسعار الفائدة عندما تزيد تؤدي إلى زيادة تكاليف الإنتاج وانخفاض معدلات الأرباح للشركات بطريقة تجعل تلك الشركات تخفض من معدلات صرفها للأرباح لأسهمها، والعكس صحيح تماماً، فإن انخفاض أسعار الفائدة في البنوك يؤدي إلى زيادة ربحية الشركات، وزيادة فوائد أسهمها بطريقة تجعل المستثمرون يتوجهون لشراء أسهم الشركات بدلاً من إيداع الأموال في البنوك.
            التضخم: يعني التضخم مجموعة من المشاكل التي تؤدي في النهاية إلى ظاهرة ارتفاع الأسعار، ويحدث التضخم بسبب زيادة حجم النقود في المجتمع عن إجمالي قيمة السلع والخدمات المقدمة في هذا المجتمع، وللقضاء على آفة التضخم يقوم البنك المركزي برفع معدلات الفائدة لتقليل حجم النقد المتداول في المجتمع وبناءً عليه يحدث انخفاض في الطلب على المنتجات والخدمات وتنخفض الأسعار.
            هذه كانت أهم المؤشرات الاقتصادية التي تتأثر بأسعار الفائدة التي يفرضها البنك المركزي لكل دولة.</p>",
            'user_id' => 1,
            'approved' => true,
            'category_id' => 3,
            'created_at' =>'2022-01-04 05:08:00'
        ]);

        DB::table('posts')->insert([
            'title' => "ثقافة الاستنقاص من الأعمال المطبخية",
            'slug' => "ثقافة-الاستنقاص-من-الأعمال-المطبخية",
            'body' => "<p>بمناسبة شهر رمضان الكريم تذكرت مثلكم جميعا الأكل! فكما تعلمون نحن نصوم عن الأكل بالدرجة الأولى.
            رغم أن تناول الطعام من أولوياتنا قبل أي نشاط آخر نمارسه بالكون إلا أن لدينا ثقافة استنقاص من أعمال تحضير هذه الأولوية المقدسة, ففي جل الثقافات حول العالم يتم إقران المطبخ بالمرأة بشكل استنقاصي, فإذا استشاط أحدهم غضبا من نقاش فلسفي دائر بينه وبين امرأة ما يردد عبارات من قبيل: عودي للمطبخ!, مكان المرأة المطبخ!, في حين أن المطبخ هو الذي يبقيه على قيد الحياة وليس فلسفاته ونقاشاته المستعرة حامية الوطيس. وعلى الطرف المقابل أولائك الذين يحاولون الإعلاء من شأن أمور المطبخ بشكل متكلف مصطنع ومنفّر (منفر لي على الأقل), فإن دل تكلّفهم على شيء فعلى مكبوتاتهم المحتقرة للعمل, فيمدح البعض المرأة بالمطبخ ويصورها في قالب شعري رومانسي على أنها تنجز أعظم الأعمال, وبحاجة لباقة ورد وقبلة على اليد, أحيانا يضيف بعض البهارات الدينية لعباراته الرنانة...في حين لن يرغب أي من هؤلاء المتكلفين المتصنعين نيل شرف إنجاز هذا العمل العظيم كما يصفونه على مواقع التواصل الاجتماعي.
            عندما يبدأ الشخص بالمبالغة في مدح بعض الأعمال على غير حقيقتها فاعلم أنه يحتقرها بدواخله! هذا على حد علمي والله أعلم!
            وليس موضوعي هنا المرأة بل المطبخ... لنركز! فحتى عدد من النساء يحتقرن أعمال تحضير الطعام وتربط بعض الحقوقيات تقدم المرأة بالتمرد على المطابخ وهدم صوامعها.
            ما الفكرة؟
            الفكرة التي أرغب في إيصالها هي أننا بحاجة لإعادة النظر في بعض القيم بمجتمعنا, إن عملية تحضير ما نأكله كبشر بديهة من البديهيات التي بالأحرى يجب أن يتقن أساسياتها الجميع, ولا أقصد هنا إتقان تحضير الأطباق الشعبية بل على الأقل تلك المعرفة الأولية الأساسية التي تبقينا على قيد الحياة, أن يتولى طرف ما من الأسرة مهمة تحضير الطعام للجميع هي مسألة من المفترض أن لا تأخذ هذا الحيز الكبير من نقاشاتنا المجتمعية, ولا أن يكون لها ذاك الوقع الهدام لحياة من يتولون المهمة, فيُحشرون اليوم كله بالمطبخ.</p>",
            'user_id' => 1,
            'approved' => true,
            'category_id' => 2,
            'created_at' =>'2022-04-07 05:08:00'
        ]);

        DB::table('posts')->insert([
            'title' => "كيف تؤثر الثقافة على الإعلانات؟",
            'slug' => "كيف-تؤثر-الثقافة-على-الإعلانات",
            'body' => "<p>تتـأثر الطريقة التي نتصرف بها كأفراد بسياقنا الثقافي، وقد تحدثت الدراسات الثقافية عن هذا الأمر منذ سبعينيات القرن الماضي. حيث أوضحت هذه الدراسات أنّ الثقافة هي برمجة ذهنية جماعية للعقل البشري، تميز مجموعة من الناس عن المجموعات الأخرى، وتؤثر على أنماط تفكير أفراد هذه الجماعات وطريقة تصرفهم واتخاذهم للقرارات.
            تعي الشركات جيدا هذا الاختلاف بين ثقافات المجتمعات المستهدفة وحتى بين الجماعات الصغيرة التي تشكل هذه المجتمعات، ولهذا تحاول زيادة الوعي بين أفراد فرق التسويق والمبيعات بخصوص هذا الاختلاف، كما تسعى لفهم الأبعاد الأساسية للثقافة المحلية التي تستهدفها من أجل التواصل بشكل أفضل مع العملاء. لأنّه وكما هو معلوم فإنّ تقديم رسائل إعلانية أكثر تناسبا مع ثقافة المجتمع المستهدف يعني تحقيق إقناع وتأثير أكبر عند العملاء المستهدفين، وعلى العكس منه تجاهل الثقافات المحلية للعملاء المحتملين يعني فشل الحملات الإعلانية في تحقيق هدفها.
            وحتى تكون الصورة أوضح، سأشارك معكم هذا المثال
             يتم التركيز في الإعلانات في بريطانيا على العاطفة وعلى إظهار الكيفية التي سيساعد بها المنتج على تغيير حياة العميل، وهو عكس ما يتم العمل به في ألمانيا، حيث يفضل العملاء الألمان الأساليب الأكثر عقلانية، والتي تتضمن تقديم معلومات أكبر حول طريقة عمل المنتج وثمنه وضماناته وإمكانية ربطه بمنتجات أخرى.
            وكمثال واقعي على هذا الفرق، عندما عرضت سلسلة المتاجر الألمانية الشهيرة Lidl إعلاناتها الموجهة للسوق الألماني في بريطانيا فشلت في جذب المستهلكين البريطانيين، ما اضطرها إلى تغيير الإعلانات الأولى وتعويضها بإعلانات جديدة تركز بشكل أكبر على التصورات الإضافية التي يمكن للمنتجات تقديمها بدل التركيز على السعر والقيمة كما كان معمول به في الإعلان الألماني، وبعد هذا التغيير حققت Lidl نتائج مذهلة.</p>",
            'user_id' => 2,
            'approved' => true,
            'category_id' => 2,
            'created_at' =>'2022-02-06 05:08:00'
        ]);
    }
}
